## Relatório de Dados V

## Tratamento de Dados Faltantes

In [1]:
import pandas as pd

In [2]:
dados= pd.read_csv('dados/aluguel_residencial.csv' , sep = ';')
dados

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,42.50,Apartamento
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,70.00,Casa
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,16.67,Apartamento
4,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,26.00,Apartamento
...,...,...,...,...,...,...,...,...,...,...,...
21821,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0,12.86,Apartamento
21822,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0,29.63,Apartamento
21823,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0,23.08,Apartamento
21824,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0,29.17,Apartamento
21825,Apartamento,Leblon,2,0,0,70,3000.0,760.0,0.0,42.86,Apartamento

In [3]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21826 entries, 0 to 21825
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Tipo           21826 non-null  object
 1   Bairro         21826 non-null  object
 2   Quartos        21826 non-null  int64
 3   Vagas          21826 non-null  int64
 4   Suites         21826 non-null  int64
 5   Area           21826 non-null  int64
 6   Valor          21826 non-null  float64
 7   Condominio     21826 non-null  float64
 8   IPTU           21826 non-null  float64
 9   Valor m2       21826 non-null  float64
 10  Tipo Agregado  21826 non-null  object
dtypes: float64(4), int64(4), object(3)
memory usage: 1.8+ MB

In [4]:
dados[dados['Valor'].notnull()]

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,42.50,Apartamento
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,70.00,Casa
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,16.67,Apartamento
4,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,26.00,Apartamento
...,...,...,...,...,...,...,...,...,...,...,...
21821,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0,12.86,Apartamento
21822,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0,29.63,Apartamento
21823,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0,23.08,Apartamento
21824,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0,29.17,Apartamento
21825,Apartamento,Leblon,2,0,0,70,3000.0,760.0,0.0,42.86,Apartamento

In [5]:
dados[dados['Valor'].isnull()]

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU, Valor m2, Tipo Agregado]
Index: []

## Removendo valores nulos do DataFrame com o "dropna"

In [19]:
a = dados.shape[0]
dados.dropna(subset=['Valor'], inplace=True )

b= dados.shape[0]

a-b

0

In [7]:
dados[dados['Valor'].isnull()]

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU, Valor m2, Tipo Agregado]
Index: []

## Tratamento de dados faltantes (continuação)

In [8]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21826 entries, 0 to 21825
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Tipo           21826 non-null  object
 1   Bairro         21826 non-null  object
 2   Quartos        21826 non-null  int64
 3   Vagas          21826 non-null  int64
 4   Suites         21826 non-null  int64
 5   Area           21826 non-null  int64
 6   Valor          21826 non-null  float64
 7   Condominio     21826 non-null  float64
 8   IPTU           21826 non-null  float64
 9   Valor m2       21826 non-null  float64
 10  Tipo Agregado  21826 non-null  object
dtypes: float64(4), int64(4), object(3)
memory usage: 1.8+ MB

In [9]:
dados[dados['Condominio'].isnull()] .shape[0]

0

In [10]:
dados[dados['IPTU'].isnull()] .shape[0]

0

## Removendo os Apartamentos não tem valor de condominio do DataFrame atraves de seleção

In [11]:
selecao = (dados['Tipo'] == 'Apartamento') & (dados['Condominio'].isnull())

In [12]:
A = dados.shape[0]
dados = dados[~selecao]
B = dados.shape[0]
A - B

0

## Transformando os valores nulos que sobraram em "0" atraves do "fillna()"

In [13]:
dados[dados['Condominio'].isnull()] .shape[0]

0

In [14]:
dados.fillna(0, inplace = True)

### Poderiamos ao inves de mudar tudo, fornecido um dicionario a função, isso é interessante quando temos que mudar os ulos para valores diferentes

In [15]:
dados = dados.fillna ({'Condominio': 0, 'IPTU': 0})

## Confirmando que a alteração foi feita e salvando o novo CSV

In [16]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21826 entries, 0 to 21825
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Tipo           21826 non-null  object
 1   Bairro         21826 non-null  object
 2   Quartos        21826 non-null  int64
 3   Vagas          21826 non-null  int64
 4   Suites         21826 non-null  int64
 5   Area           21826 non-null  int64
 6   Valor          21826 non-null  float64
 7   Condominio     21826 non-null  float64
 8   IPTU           21826 non-null  float64
 9   Valor m2       21826 non-null  float64
 10  Tipo Agregado  21826 non-null  object
dtypes: float64(4), int64(4), object(3)
memory usage: 1.8+ MB

In [17]:
dados.to_csv('dados/aluguel_residencial.csv', sep = ';', index = False)